[
  {
    "code" : "TOEIC",
    "category" : 11,
    "ects" : 6,
    "title" : "Test of English for International Communication",
    "goals" : [ 
               " English language test designed specifically to measure the everyday English skills of people working in an international environment."
             ],
    "chapters" : [],
    "score": 750,
    "scoreMax": 990,
    "date" : "June 2013"
  },{
    "code" : "NFE113",
    "category" : 0,
    "ects" : 6,
    "title" : "Design and administration of databases",
    "goals" : [ 
               "Savoir concevoir et administrer une base de données relationnelle.",
               "Manipuler une base de données relationnelle via un langage procédural tel PL/SQL.",
               "Connaître les caractéristiques du SGBD Oracle."  
              ],
    "chapters" : [],
    "score": 14,
    "scoreMax": 20,
    "date" : "June 2012"
  },
  {
    "code" : "TET102",
    "category" : 1,
    "ects" : 6,
    "title" : "Social management for engineer, and business communication",
    "goals" : [ 
               "Sensibiliser les ingénieurs et cadres techniques aux aspects humains du fonctionnement des organisations.",
               "Mesurer les enjeux de la GRH et du Management.",
               "Acquérir des bases en droit social.",
               "Acquérir les outils et les repères théoriques  pour mieux communiquer en situation de travail"  
              ],
    "chapters" : [],
    "score": 17.5,
    "scoreMax": 20,
    "date" : "June 2012"
  },
  {
    "code" : "RCP101",
    "category" : 3,
    "ects" : 6,
    "title" : "Operations Research and Decision Support",
    "goals" : [ 
               "Présenter des notions de recherche opérationnelle et d'aide à la décision indispensables pour de futurs ingénieurs, décideurs, responsables de projets." 
             ],
    "chapters" : [],
    "score": 18,
    "scoreMax": 20,
    "date" : "February 2013"
  },
  {
    "code" : "NSY103",
    "category" : 9,
    "ects" : 6,
    "title" : "Linux : Principles and programmation",
    "goals" : [ 
               "Savoir développer une application multi processus utilisant des outils de communication et de synchronisation sous Linux/Unix.",
               "Appréhender les mécanismes fondamentaux des systèmes d'exploitation" ,
               "Comprendre la problématique des systèmes temps réels et les particularités de ces systèmes" 
              ],
    "chapters" : [],
    "score": 19,
    "scoreMax": 20,
    "date" : "February 2013"
  },
  {
    "code" : "NFP121",
    "category" : 2,
    "ects" : 6,
    "title" : "Advanced programming",
    "goals" : [
               "Maitriser les concepts avancés de la programmation objet en Java.",
               "Apprendre à identifier et utiliser les patrons (design pattern) adaptés à une situation de conception."
             ],
    "chapters" : [],
    "score": 14.5,
    "scoreMax": 20,
    "date" : "February 2013"
  },
  {
    "code" : "RCP110",
    "category" : 3,
    "ects" : 6,
    "title" : "Operations research and advanced linear programming",
    "goals" : [ 
               "Approfondir un des thèmes majeurs de la recherche opérationnelle : la programmation linéaire" 
             ],
    "chapters" : [],
    "score": 17,
    "scoreMax": 20,
    "date" : "June 2013"
  },
  {
    "code" : "RSX112",
    "category" : 4,
    "ects" : 6,
    "title" : "Security and networks",
    "goals" : [ 
               "Ce cours présente les principaux aspects de la sécurité des réseaux.",
               "Il traite des problèmes généraux de sécurité (confidentialité, intégrité, authentification, protection, non répudiation), et des solutions types connues pour ces problèmes.",
               "Il présente la mise en oeuvre de ces solutions dans l'architecture Internet." 
              ],
    "chapters" : [],
    "score": 11,
    "scoreMax": 20,
    "date" : "June 2013"
  },
  {
    "code" : "RSX102",
    "category" : 4,
    "ects" : 6,
    "title" : "Technologies for client-server applications",
    "goals" : [ 
               "Ce cours concerne les applications en mode client serveur dans l'architecture Internet.",
               "Il détaille les protocoles des réseaux des couches hautes (niveaux session, présentation, application) avec une orientation marquée vers les protocoles d'application (DNS, SMTP... ) et les Web Services." 
              ],
    "chapters" : [],
    "score": 14,
    "scoreMax": 20,
    "date" : "June 2013"
  },
  {
    "code" : "NFP107",
    "category" : 0,
    "ects" : 6,
    "title" : "Databases management system",
    "goals" : [ 
               "Connaissance approfondie des SGBD relationnels à tous les niveaux.",
               "Maitrise du langage SQL."
             ],
    "chapters" : [],
    "score": 18.25,
    "scoreMax": 20,
    "date" : "February 2014"
  },
  {
    "code" : "NFE108",
    "category" : 5,
    "ects" : 6,
    "title" : "Methodologies of information systems",
    "goals" : [ 
               "Mener l'analyse et la conception d'un système d'information depuis l'analyse des besoins en appliquant une méthode orientée-objet inspirée des pratiques du processus unifié.",
               "Etre capable de prendre en compte la qualité du produit de l'analyse et ce en respectant les principes de la conception orientée-objet tels que la modularité et l'évolutivité." 
             ],
    "chapters" : [],
    "score": 20,
    "scoreMax": 20,
    "date" : "February 2013"
  },
  {
    "code" : "NFE107",
    "category" : 8,
    "ects" : 6,
    "title" : "Urbanization and architecture of information systems",
    "goals" : [ 
                "Présentation de l'ensemble des concepts de base, les pré-requis et les règles de bonnes pratiques qui sous-tendent une étude d'urbanisation et d'architecture structurée selon les trois visions suivantes : La vision métier (Quels métiers) / La vision fonctionnelle (Quoi) /La vision Informatique (Comment)."  
             ],
    "chapters" : [],
    "score": 14.5,
    "scoreMax": 20,
    "date" : "February 2014"
  },
  {
    "code" : "EME102",
    "category" : 6,
    "ects" : 6,
    "title" : "Management and businesses organization",
    "goals" : [ 
               "Sensibiliser les ingénieurs et cadres de formation initiale technique aux aspects économiques et managériaux de leur métier.",
               "Les ouvrir à la complexité de l'environnement socio-économique de l'entreprise",
               "Leur faire connaître les outils de gestion des activités les concernant tout particulièrement : les aider à comprendre l'impact sur leur fonction et à développer un comportement adapté."
              ],
    "chapters" : [],
    "score": 14.5,
    "scoreMax": 20,
    "date" : "February 2014"
  },
  {
    "code" : "NFE209",
    "category" : 7,
    "ects" : 6,
    "title" : "Engineering of information systems - Audit and Governance",
    "goals" : [ 
               "Maîtriser les méthodes, modèles et outils utilisées dans la planification et l'évaluation des systèmes d'information",
               "Elaborer un schéma stratégique des systèmes d'information",
               "Mettre en oeuvre une démarche d'audit informatique"
             ],
    "chapters" : [],
    "score": 13.5,
    "scoreMax": 20,
    "date" : "February 2014"
  },
  {
    "code" : "NFE210",
    "category" : 7,
    "ects" : 6,
    "title" : "Engineering of information systems - Advanced methods",
    "goals" : [ 
               "Maîtriser les méthodes, modèles et outils utilisés dans la conception et l'évolution des systèmes d'information",
               "Etre capable d'assurer l'évolution et la maintenance d'un système d'information existant",
               "Maîtriser les techniques et outils de gestion de projet informatique",
               "Etre en mesure d'adapter les méthodes existantes aux besoins spécifiques de certains systèmes d'information"
             ],
    "chapters" : [],
    "score": 12.5,
    "scoreMax": 20,
    "date" : "June 2014"
  },
  {
    "code" : "NFE103",
    "category" : 5,
    "ects" : 6,
    "title" : "Advanced methodologies",
    "goals" : [ 
               "Acquérir les concepts et les notations utilisés par le langage UML.",
               "Maîtriser un atelier UML",
               "Acquérir les bases méthodologiques essentielles résultant des derniers développements des méthodes orientées objet.",
               "Faire la synthèse des techniques orientées-objet de conception des systèmes d'information d'entreprise."  
              ],
    "chapters" : [],
    "score": 13,
    "scoreMax": 20,
    "date" : "June 2014"
  },
  {
    "code" : "NFE102",
    "category" : 2,
    "ects" : 6,
    "title" : "Technological infrastructure for e-commerce",
    "goals" : [ 
               "Maîtriser la conception et la mise en oeuvre des architectures technologiques d'un site de commerce électronique."
             ],
    "chapters" : [],
    "score": 17,
    "scoreMax": 20,
    "date" : "June 2014"
  },
  {
    "code" : "ENG210",
    "category" : 10,
    "ects" : 6,
    "title" : "Practice of the engineering profession",
    "goals" : [ 
               "Ouvrir l'horizon de l'élève-ingénieur en vue de l'exercice futur de ses responsabilités.",
               "Aborder les méthodologies de gestion de projet, de façon systémique ou au travers d'illustrations relatives à des projets identifiés."
             ],
    "chapters" : [],
    "score": 0,
    "scoreMax": 20,
    "date" : "February 2015"
  },
  {
    "code" : "ENG221",
    "category" : 10,
    "ects" : 6,
    "title" : "Information and Communication for the engineer",
    "goals" : [ 
               "Savoir maîtriser l'information spécialisée : Chercher l'information, l'évaluer, la valider ; Produire et communiquer l'information.",
               "Savoir communiquer en situation professionnelle par écrit et à l'oral."
             ],
    "chapters" : [],
    "score": 0,
    "scoreMax": 20,
    "date" : "June 2015"
  }
]